# Final Python Exam for Information Structures Spring 2021

* There are 20 questions, each worth 5 points and 1 bonus question worth 5 points (wont count against you if you miss it).
* The final is due Friday March 19 by 5:00 PM CST
* This is an "open book" exam, meaning you can use any resource at your disposal except other students.
* Email immediately if you need clarification on any question.  [dokoch@lispcomb.edu]

---

Execute the following two code cells to begin your Python session.

---

In [3]:
# Standard imports.
import saspy
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
from IPython.display import HTML
from datetime import datetime
from numpy import nan as NA
import math
import sys

In [4]:
# Get a SAS session object
sas = saspy.SASsession(cfgname="oda")

SAS Connection established. Subprocess id is 13240

---
## Problem 1
---

Question 1.1: Complete the statement below to create a SASData object to retrieve data from SASHELP.CARS data set.

In [5]:
cars_sd = sas.sasdata('cars', 'sashelp')
cars_sd.head()

,Make,Model,Type,Origin,DriveTrain,MSRP,Invoice,EngineSize,Cylinders,Horsepower,MPG_City,MPG_Highway,Weight,Wheelbase,Length
0,Acura,MDX,SUV,Asia,All,36945,33337,3.5,6,265,17,23,4451,106,189
1,Acura,RSX Type S 2dr,Sedan,Asia,Front,23820,21761,2.0,4,200,24,31,2778,101,172
2,Acura,TSX 4dr,Sedan,Asia,Front,26990,24647,2.4,4,200,22,29,3230,105,183
3,Acura,TL 4dr,Sedan,Asia,Front,33195,30299,3.2,6,270,20,28,3575,108,186
4,Acura,3.5 RL 4dr,Sedan,Asia,Front,43755,39014,3.5,6,225,18,24,3880,115,197

Question 1.2: Complete the statement below to create a new SASData object from the **cars_sd** object where the records are filtered to only include cars made in USA and with an MSRP greater than $30,000.

In [14]:
cars_us_luxury_sd = cars_sd.where('Origin = "USA"  and MSRP > 30000')
cars_us_luxury_sd.head()

,Make,Model,Type,Origin,DriveTrain,MSRP,Invoice,EngineSize,Cylinders,Horsepower,MPG_City,MPG_Highway,Weight,Wheelbase,Length
0,Buick,Rainier,SUV,USA,All,37895,34357,4.2,6,275,15,21,4600,113,193
1,Buick,LeSabre Limited 4dr,Sedan,USA,Front,32245,29566,3.8,6,205,20,29,3591,112,200
2,Buick,Park Avenue 4dr,Sedan,USA,Front,35545,32244,3.8,6,205,20,29,3778,114,207
3,Buick,Park Avenue Ultra 4dr,Sedan,USA,Front,40720,36927,3.8,6,240,18,28,3909,114,207
4,Cadillac,Escalade,SUV,USA,Front,52795,48377,5.3,8,295,14,18,5367,116,199

Question 1.3: Complete the statement below to create a new DataFrame object using a method from the **cars_us_luxury_sd** SASData object.

In [15]:
cars_us_luxury_df = cars_us_luxury_sd.to_df()
cars_us_luxury_df.head()

,Make,Model,Type,Origin,DriveTrain,MSRP,Invoice,EngineSize,Cylinders,Horsepower,MPG_City,MPG_Highway,Weight,Wheelbase,Length
0,Buick,Rainier,SUV,USA,All,37895,34357,4.2,6,275,15,21,4600,113,193
1,Buick,LeSabre Limited 4dr,Sedan,USA,Front,32245,29566,3.8,6,205,20,29,3591,112,200
2,Buick,Park Avenue 4dr,Sedan,USA,Front,35545,32244,3.8,6,205,20,29,3778,114,207
3,Buick,Park Avenue Ultra 4dr,Sedan,USA,Front,40720,36927,3.8,6,240,18,28,3909,114,207
4,Cadillac,Escalade,SUV,USA,Front,52795,48377,5.3,8,295,14,18,5367,116,199

Question 1.4: Complete the statement below to create a new column in **cars_us_luxury_df** called **Difference** that is the difference between **MSRP** and **Invoice**.

In [16]:
cars_us_luxury_df['Difference'] = cars_us_luxury_df['MSRP'] - cars_us_luxury_df['Invoice']
cars_us_luxury_df.head()

,Make,Model,Type,Origin,DriveTrain,MSRP,Invoice,EngineSize,Cylinders,Horsepower,MPG_City,MPG_Highway,Weight,Wheelbase,Length,Difference
0,Buick,Rainier,SUV,USA,All,37895,34357,4.2,6,275,15,21,4600,113,193,3538
1,Buick,LeSabre Limited 4dr,Sedan,USA,Front,32245,29566,3.8,6,205,20,29,3591,112,200,2679
2,Buick,Park Avenue 4dr,Sedan,USA,Front,35545,32244,3.8,6,205,20,29,3778,114,207,3301
3,Buick,Park Avenue Ultra 4dr,Sedan,USA,Front,40720,36927,3.8,6,240,18,28,3909,114,207,3793
4,Cadillac,Escalade,SUV,USA,Front,52795,48377,5.3,8,295,14,18,5367,116,199,4418

Problem 1.5: Complete the statement below to only keep the "Model", "Type", "Origin", "MSRP" and "Difference" columns.

In [17]:
cars_us_luxury_df = cars_us_luxury_df.loc[:, ['Model', 'Type', 'Origin', 'MSRP', 'Difference']]
cars_us_luxury_df.head()

                   Model   Type Origin   MSRP  Difference
0                Rainier    SUV    USA  37895        3538
1    LeSabre Limited 4dr  Sedan    USA  32245        2679
2        Park Avenue 4dr  Sedan    USA  35545        3301
3  Park Avenue Ultra 4dr  Sedan    USA  40720        3793
4               Escalade    SUV    USA  52795        4418

---
## Problem 2
---

Run the following code cell to create a *SASData* object called **heart_sd** and a *DataFrame* object called **heart_df**

In [18]:
heart_sd = sas.sasdata('heart', 'sashelp')
heart_df = heart_sd.to_df()

JupyterLab Notebooks support "magic" commands, which begin with a % and fulfill various utility purposes.\
The **%time** magic command provides a way to see how long a Python statement takes to execute.\
One of the outputs of **%time** is "Wall time:" which measures how long the command took according to the clock on your wall, or total elapsed time.  Time is usually reported in seconds (s) or micro seconds (µs).  

Execute the following two .head(1) statements and answer the following question.

In [19]:
%time heart_sd.head(1)

Wall time: 4.94 s

,Status,DeathCause,AgeCHDdiag,Sex,AgeAtStart,Height,Weight,Diastolic,Systolic,MRW,Smoking,AgeAtDeath,Cholesterol,Chol_Status,BP_Status,Weight_Status,Smoking_Status
0,Dead,Other,NaN,Female,29,62.5,140,78,124,121,0,55,NaN,NaN,Normal,Overweight,Non-smoker

In [20]:
%time heart_df.head(1)

Wall time: 998 µs

,Status,DeathCause,AgeCHDdiag,Sex,AgeAtStart,Height,Weight,Diastolic,Systolic,MRW,Smoking,AgeAtDeath,Cholesterol,Chol_Status,BP_Status,Weight_Status,Smoking_Status
0,Dead,Other,NaN,Female,29,62.5,140.0,78,124,121.0,0.0,55.0,NaN,NaN,Normal,Overweight,Non-smoker

Question 2.1: Which object takes longer to execute?

Answer 2.1: **The SASData object takes longer.**

Question 2.2: Explain why there is a significant difference in the execute times of these two statements.

Answer 2.2: **The SASData object is getting data from an outside remote SAS server where the data stays, while the DataFrame object is pulling data from the Python client machine, so execution is local. Since it is local, it takes a lot less time.**

---
The Python **sys** library has a method called **sys.getsizeof()** which returns the number of bytes that the object takes up in memory.

Execute the following two code cells and answer the the following question.

In [21]:
sys.getsizeof(heart_df)

2663039

In [22]:
sys.getsizeof(heart_sd)

48

Question 2.3: Which object uses more of your computers memory?

Answer 2.3: **The DataFrame object uses more of my computer's memory.**

Question 2.4: Why is there such a significant difference in the memory requirements of these two objects?

Answer 2.4: **Because all the data is being pulled into the Python session for the DataFrame object, the data pull takes up more memory than with the SASData object, where all the data stays on a remote server.**

---
## Problem 3
---

Question 3.1: Create a dictionary that contains the following Key/Value pairs.

| Key | Value | 
| --- | --- | 
| C | Cantaloupe | 
| A   | Apple | 
| D | Dog | 
| B   | Banana |

In [26]:
fruit_dict = {'A':'Apple', 'B':'Banana', 'C':'Cantaloupe', 'D':'Dog'}
fruit_dict

{'A': 'Apple', 'B': 'Banana', 'C': 'Cantaloupe', 'D': 'Dog'}

Question 3.2: Which item in the dictionary is not actually a fruit?

Answer 3.2: **Item with key D is not a fruit, it has the value "Dog", which is an animal.**

Question 3.3: Complete the statement below to print out the following message:

```
The dictionary item <key> is <value> and not really a fruit
```

Use variable references to replace \<key\> and \<value\> in the format string.

In [27]:
# Put the appropriate key value between the quotes.
key = 'D'

# Put a properly formatted format string between the quotes
print(f'The dictionary item {key} is {fruit_dict[key]} and not really a fruit')

The dictionary item D is Dog and not really a fruit

Question 3.4: Complete the statement below to add the new Key/Value pair 'E'/'Eggplant'.

In [28]:
fruit_dict['E'] = 'Eggplant' 
fruit_dict

{'A': 'Apple', 'B': 'Banana', 'C': 'Cantaloupe', 'D': 'Dog', 'E': 'Eggplant'}

---
## Problem 4
---

Execute the next code cell to complete the questions in Problem 4.

In [30]:
data = {'Name':    ['Alfred', 'Alice', 'Barbara', 'Carol', 'Henry'],
        'Sex':     ['M', 'F', 'F', 'F', 'M'],
        'Age':     [14, 13, 13, 14, 13],
        'Height':  [69, 65.5, 65.3, 62.8, 63.5],
        'Weight':  [112.5, 84, 98, 102.5, 102.5],
       }

In [34]:
type(data)

dict

Question 4.1: What type of object is **data**?

Answer 4.1: **Dictionary**

In [35]:
type(data['Name'])

list

Question 4.2: What are the object types of the Keys and Values in **data**?

Answer 4.2: **The keys and values are in a list.**

Question 4.3: Complete the code below to create a new DataFrame using the **data** object.

In [36]:
students_df = pd.DataFrame(data)
students_df

      Name Sex  Age  Height  Weight
0   Alfred   M   14    69.0   112.5
1    Alice   F   13    65.5    84.0
2  Barbara   F   13    65.3    98.0
3    Carol   F   14    62.8   102.5
4    Henry   M   13    63.5   102.5

Question 4.4: Complete the statement below with the method would you use to print out summary statistics for this data?

In [37]:
students_df.describe()

             Age     Height      Weight
count   5.000000   5.000000    5.000000
mean   13.400000  65.220000   99.900000
std     0.547723   2.407696   10.352536
min    13.000000  62.800000   84.000000
25%    13.000000  63.500000   98.000000
50%    13.000000  65.300000  102.500000
75%    14.000000  65.500000  102.500000
max    14.000000  69.000000  112.500000

Question 4.5: Complete the statement below to find the Pearson's correlation coefficient for **Age** versus **Height** and **Age** versus **Weight**?

Answer 4.5: **Age vs Height:** 0.257820. **Age vs Weight:** 0.670156.

In [38]:
students_df.corr()

             Age    Height    Weight
Age     1.000000  0.257820  0.670156
Height  0.257820  1.000000  0.323561
Weight  0.670156  0.323561  1.000000

Question 4.6: True or False: Weight is a better predictor of Age than height. 

Answer 4.6: **True**

Question 4.7: We just received the grade information for these students:

| Name | Grade | 
| --- | --- | 
| Alfred | 8|
| Alice | 7 | 
| Barbara | 6 | 
| Carol | 8 | 
| Henry | 8 | 

Complete the statement below to add a "Grade" column to the DataFrame.

In [39]:
students_df['Grade'] = [8, 7, 6, 8, 8]
students_df

      Name Sex  Age  Height  Weight  Grade
0   Alfred   M   14    69.0   112.5      8
1    Alice   F   13    65.5    84.0      7
2  Barbara   F   13    65.3    98.0      6
3    Carol   F   14    62.8   102.5      8
4    Henry   M   13    63.5   102.5      8

**BONUS QUESTION:**  The operation of transposing a table involves "rotating" the table so that the rows become columns and columns become rows.

Using the methods for discovering what an object is capable of that we discussed
in class, create a new DataFrame that is a transpose of the students_df DataFrame.

In [40]:
students_transposed_df = students_df.T
students_transposed_df

             0      1        2      3      4
Name    Alfred  Alice  Barbara  Carol  Henry
Sex          M      F        F      F      M
Age         14     13       13     14     13
Height      69   65.5     65.3   62.8   63.5
Weight   112.5     84       98  102.5  102.5
Grade        8      7        6      8      8

---
# End of Final
---